import { Component} from '@angular/core';

@Component({
  templateUrl: './faq.component.html',
  styleUrl:'./faq.component.scss',
})
export class FAQComponent {

  questions = [
    { question: 'لا أتذكر كلمة المرور الخاصة بي', answer: 'إذا نسيت كلمة المرور الخاصة بك، يمكنك إعادة تعيينها عن طريق خيار "نسيت كلمة المرور" المتاح على الصفحة الرئيسية لتسجيل الدخول. قم باتباع التعليمات لإعادة تعيين كلمة المرور عبر البريد الإلكتروني أو رقم الهاتف المرتبط بحسابك.' },
    { question: 'كيف يمكنني إنشاء حساب على', answer: '    إذا نسيت كلمة المرور الخاصة بك، يمكنك إعادة تعيينها عن طريق خيار "نسيت كلمة المرور" المتاح على الصفحة الرئيسية لتسجيل الدخول. قم باتباع التعليمات لإعادة تعيين كلمة المرور عبر البريد الإلكتروني أو رقم الهاتف المرتبط بحسابك.' },
    { question: 'ما هى ساعات التسليم ', answer: '    إذا نسيت كلمة المرور الخاصة بك، يمكنك إعادة تعيينها عن طريق خيار "نسيت كلمة المرور" المتاح على الصفحة الرئيسية لتسجيل الدخول. قم باتباع التعليمات لإعادة تعيين كلمة المرور عبر البريد الإلكتروني أو رقم الهاتف المرتبط بحسابك.' },
    { question: 'أوريد فاتورة لطلبي', answer: '    إذا نسيت كلمة المرور الخاصة بك، يمكنك إعادة تعيينها عن طريق خيار "نسيت كلمة المرور" المتاح على الصفحة الرئيسية لتسجيل الدخول. قم باتباع التعليمات لإعادة تعيين كلمة المرور عبر البريد الإلكتروني أو رقم الهاتف المرتبط بحسابك.' },
  ];


}
